import React from 'react';
import css from './Love.module.css';

const Love = () => {
  return (
    <div className={css.Love}>
      <span className={css.title}>👩🏻‍❤️‍💋‍👨🏽</span>
      <ul className={css.list}>
        <li>
          <h3 className={css.data}>29.09.2022</h3>
          <p className={css.memories}>
            Цього дня ти мені написала і я був чутка в шоці, що ти рішила
            написати мені, але я сразу поняв, шо якшо-шо то без помощі на курсі
            не лишусь
          </p>
        </li>
        <li>
          <h3 className={css.data}>Амеріка</h3>
          <p className={css.memories}>
            Общались чисто як знайомі, даже здружились не сразу. Могли то кожен
            день общатись, то по днів 5 не давати про себе знати, але шось
            вертало то тебе то мене.
          </p>
        </li>
        <li>
          <h3 className={css.data}>Still in Амеріка</h3>
          <p className={css.memories}>
            Сталась дуууже не камельфо ситуація для мене, тай по моїй вині, зато
            для тебе смішна
          </p>
        </li>
        <li>
          <h3 className={css.data}>Тобі не спалось</h3>
          <p className={css.memories}>
            Наш перший раз коли ми добре пообщались, і нормально здружились. Це
            ще Америка, я одного вечора з бабусьою дивився серіал по Нетфлікс. І
            тут бачу шо хтось пише, а то тииии. Я почав тобі розказувати шо за
            серіал дивимось, тай тема за темою і я поняв шо з тобою цікаво. Ця
            наша розмова для мене як початок наших дружніх відносин
          </p>
        </li>
      </ul>
    </div>
  );
};

export default Love;
